In [1]:
import pandas as pd

# ny.to_csv('final_ny.csv')

In [2]:
reviews = pd.read_csv('reviews.csv')

In [8]:
ny = pd.read_csv('final_ny.csv', index_col=0)

In [9]:
reviews.head(2)

      camis                publish_time review_text  review_rating
0  41375676  2023-11-01 02:44:04.226505         NaN              5
1  41375676  2023-11-01 02:44:04.227451         NaN              5

In [5]:
ny.head(2)

,camis,dba,boro,phone,inspection_date,latitude,longitude,cuisine_description,action,score,grade,full_address,violation_code,violation_description
0,41168748,DUNKIN,Bronx,7188614171,2022-03-30T00:00:00.000,40.816753,-73.892364,Donuts,Violations cited,13,A,880 GARRISON AVENUE 10474,10J 04N 08A,Hand wash sign not posted Filth flies or food/...
1,41688142,TABLE 87,Brooklyn,9176186100,2017-01-25T00:00:00.000,40.683447,-73.975691,Pizza,No violations,0,A,620 ATLANTIC AVENUE 11217,No violation,No violation

In [16]:
# Convert the 'publish_time' column to datetime, handling ISO8601 format
reviews['publish_time'] = pd.to_datetime(reviews['publish_time'], format='mixed')

In [17]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61337 entries, 0 to 61336
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   camis          61337 non-null  int64
 1   publish_time   61337 non-null  object
 2   review_text    54434 non-null  object
 3   review_rating  61337 non-null  int64
dtypes: int64(2), object(2)
memory usage: 1.9+ MB

In [18]:
reviews.head(2)

      camis                publish_time review_text  review_rating
0  41375676  2023-11-01 02:44:04.226505         NaN              5
1  41375676  2023-11-01 02:44:04.227451         NaN              5

In [6]:
ny.info()

<class 'pandas.core.frame.DataFrame'>
Index: 60825 entries, 0 to 60824
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   camis                  60825 non-null  int64
 1   dba                    60825 non-null  object
 2   boro                   60825 non-null  object
 3   phone                  60825 non-null  int64
 4   inspection_date        60825 non-null  object
 5   latitude               60825 non-null  float64
 6   longitude              60825 non-null  float64
 7   cuisine_description    60825 non-null  object
 8   action                 60825 non-null  object
 9   score                  60825 non-null  int64
 10  grade                  60825 non-null  object
 11  full_address           60825 non-null  object
 12  violation_code         60825 non-null  object
 13  violation_description  60825 non-null  object
dtypes: float64(2), int64(3), object(9)
memory usage: 7.0+ MB

In [20]:
ny['inspection_date'] = pd.to_datetime(ny['inspection_date'])
reviews.head(2)

      camis                publish_time review_text  review_rating
0  41375676  2023-11-01 02:44:04.226505         NaN              5
1  41375676  2023-11-01 02:44:04.227451         NaN              5

making a unique list of ny dataframe and removing the restaurants that have reviews scraped/aquired.

In [12]:
ny.head(2)

,camis,dba,boro,phone,inspection_date,latitude,longitude,cuisine_description,action,score,grade,full_address,violation_code,violation_description
0,41168748,DUNKIN,Bronx,7188614171,2022-03-30T00:00:00.000,40.816753,-73.892364,Donuts,Violations cited,13,A,880 GARRISON AVENUE 10474,10J 04N 08A,Hand wash sign not posted Filth flies or food/...
1,41688142,TABLE 87,Brooklyn,9176186100,2017-01-25T00:00:00.000,40.683447,-73.975691,Pizza,No violations,0,A,620 ATLANTIC AVENUE 11217,No violation,No violation

In [13]:
# Creating a new DataFrame with the selected columns
selected_columns = ['camis', 'dba', 'boro', 'phone', 'full_address']
unique_ny = ny[selected_columns].drop_duplicates()
len(unique_ny), unique_ny.camis.nunique()

(25820, 25820)

In [15]:
unique_ny.head(2)

      camis       dba      boro       phone               full_address
0  41168748    DUNKIN     Bronx  7188614171  880 GARRISON AVENUE 10474
1  41688142  TABLE 87  Brooklyn  9176186100  620 ATLANTIC AVENUE 11217

In [16]:
reviews.head(2)

      camis                publish_time review_text  review_rating
0  41375676  2023-11-01 02:44:04.226505         NaN              5
1  41375676  2023-11-01 02:44:04.227451         NaN              5

In [17]:
len(reviews)

61337

In [19]:
# Get unique 'camis' values from the reviews DataFrame
reviews_unique_camis = reviews['camis'].unique()

# Filter out the rows in unique_ny where 'camis' is in the reviews_unique_camis
unique_ny_cleaned = unique_ny[~unique_ny['camis'].isin(reviews_unique_camis)]

In [20]:
len(unique_ny_cleaned), len(ny)

(19682, 60825)

In [21]:
unique_ny_cleaned.head()

,camis,dba,boro,phone,full_address
5,50130923,LORENZO'S PIZZERIA,Bronx,7186187053,1226 SOUTHERN BOULEVARD 10459
8,50052842,CUP OF BROOKLYN,Brooklyn,9178555647,1071B GATES AVE 0
11,50116983,EL BASURERO BAR REST.,Queens,7185457077,3217 STEINWAY ST 11103
24,50008239,NEW YORK YANKEES MVP CLUB,Bronx,6469778510,1 EAST 161 STREET 10451
30,41599169,ROMA PIZZA,Brooklyn,7187837334,85 7 AVENUE 11217

In [24]:
unique_ny_cleaned.drop_duplicates(subset='camis')
len(unique_ny_cleaned)

19682

In [23]:
# Creating a new DataFrame with the selected columns
selected_columns = ['camis', 'place_id']
ny_for_scrape = unique_ny_cleaned[selected_columns].drop_duplicates(subset='camis')
len(ny_for_scrape), ny_for_scrape.camis.nunique()

KeyError: "['place_id'] not in index"